# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 9  # number of classes 类别数
depth_multiple: 0.33  # model depth multiple 模型深度
width_multiple: 0.50  # layer channel multiple 控制conv 通道的个数，卷积核数量
#depth_multiple: 表示BottleneckCSP模块的层缩放因子，将所有的BotleneckCSP模块的B0ttleneck乘上该参数得到最终个数
#width_multiple表示卷积通道的缩放因子，就是将配置里的backbone和head部分有关conv通道的设置，全部乘以该系数
anchors:
  - [10,13, 16,30, 33,23]  # P3/8 检测小目标，10,13是一组尺寸，总共三组检测小目标
  - [30,61, 62,45, 59,119]  # P4/16 检测中目标，共三组
  - [116,90, 156,198, 373,326]  # P5/32 检测大目标，共三组

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args] args：是一个 list，模块搭建所需参数，channel，kernel_size，stride，padding，bias等,会在网络搭建过程中根据不同层进行改变
  #from 列参数 ：当前模块输入来自那一层输出，-1 表示是从上一层获得的输入
  #number 列参数：本模块重复次数，1 表示只有一个，3 表示有三个相同的模块
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4 128表示128个卷积核，3 表示3*3卷积核，2表示步长为2
   [-1, 3, C3_DCN, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3_DCN, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3_DCN, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [1024]],
   [-1, 1, SPPF_1, [1024, 5]],  # 9
  ]

# YOLOv5 v6.0 head
#作者没有分neck模块，所以head部分包含了panet+detect部分
head:
  [
     [-1, 1, Conv, [512, 1, 1]], # 10
     [-1, 1, Conv, [256, 3, 1, 1]], # 11
     [6, 1, dw1, [256]], # 12
     [4, 1, dw1, [256]], # 13
     [-1, 1, dw1, [256]], # 14
     [[-1, 11, 12], 1, Concat, [1]],  # 15
     [-1, 1, Conv, [512, 1, 1]], # 16
     [-1, 1, SEPC_DSC, [512]],  # 17
     [-1, 1, Conv, [1024, 1, 1]], # 18
     [6, 1, Conv, [256, 3, 1, 1]], # 19
     [11, 1, CARAFE, [256,3,2]],  # 20
     [[19, 13, -1], 1, Concat, [1]],  # 21
     [-1, 1, Conv, [512, 1, 1]], # 22
     [-1, 1, SEPC_AK, [512]],  # 23
     [4, 1, Conv, [256, 3, 1, 1]], # 24
     [19, 1, CARAFE, [256,3,2]],  # 25
     [20, 1, CARAFE, [256,3,2]],  # 26
     [[24, 25, 26], 1, Concat, [1]],  # 27
     [-1, 1, Conv, [512, 1, 1]], # 28
     [-1, 1, SEPC_AK, [512]],  # 29
     [-1, 1, Conv, [256, 1, 1]], # 30
     [23, 1, Conv, [256, 1, 1]], # 31
     [-1, 1, dw1, [256]], # 32
     [30, 1, dw1, [256]], # 33
     [-1, 1, dw1, [256]], # 34
     [[-1, 32, 18], 1, Concat, [1]],  # 35
     [-1, 1, Conv, [512, 1, 1]], # 36
     [-1, 1, SEPC_DSC, [512]],  # 37
     [-1, 1, Conv, [256, 1, 1]], # 38
     [18, 1, CARAFE, [256,3,2]],  # 39
     [[31, 33, -1], 1, Concat, [1]],  # 40
     [-1, 1, Conv, [512, 1, 1]], # 41
     [-1, 1, SEPC_AK, [512]],  # 42
     [31, 1, CARAFE, [256,3,2]],  # 43
     [39, 1, CARAFE, [256,3,2]],  # 44
     [[30, 43, 44], 1, Concat, [1]],  # 45
     [-1, 1, Conv, [512, 1, 1]], # 46
     [-1, 1, SEPC_AK, [512]],  # 47
     [-1, 1, Conv, [256, 1, 1]], # 48
     [42, 1, Conv, [256, 1, 1]], # 49
     [42, 1, dw1, [256]], # 50
     [48, 1, dw1, [256]], # 51
     [-1, 1, dw1, [256]], # 52
     [[-1, 50, 38], 1, Concat, [1]],  # 53
     [-1, 1, Conv, [512, 1, 1]], # 54
     [-1, 1, SEPC_DSC, [512]],  # 55
     [-1, 1, Conv, [1024, 1, 1]], # 56
     [38, 1, CARAFE, [256,3,2]],  # 57
     [[-1, 49, 51], 1, Concat, [1]],  # 58
     [-1, 1, Conv, [512, 1, 1]], # 59
     [-1, 1, SEPC_AK, [512]],  # 60
     [49, 1, CARAFE, [256,3,2]],  # 61
     [57, 1, CARAFE, [256,3,2]],  # 62
     [[-1, 61, 48], 1, Concat, [1]],  # 63
     [-1, 1, Conv, [512, 1, 1]], # 64
     [-1, 1, SEPC_AK, [512]],  # 65
     [-1, 1, Conv, [256, 1, 1]], # 66
     [[66,60,56], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]


